Tekla.Structures.Plugins.ConnectionBase
The ConnectionBase class is a base class for defining connections, details and seams.
These types are more specialized and restricted by the input values than the ones derived
from PluginBase.
The coordinate system for connections, details and seams is explained in the Tekla Structures
help, in the part about the position type of custom components. The position type defines the
origin of the custom component, relative to the main part.
In the following example, a .inp file is used for defining the dialog.
Notice that starting from version 15.0, the System.Windows.Forms namespace
can be used to create rich user interfaces. See e.g. the PluginFormBase class
in the Tekla.Structures.Dialog documentation for more information. When using System.Windows.Forms,
the name of the form has to be the same one as the connection name for ConnectionBase, otherwise
the form will be loaded and shown but the apply method won't work (modify will work).
using System;
using System.Windows.Forms;
using Tekla.Structures;
using Tekla.Structures.Plugins;
using Tekla.Structures.Geometry3d;
using TSM = Tekla.Structures.Model;
public class StructuresData3
{
[Tekla.Structures.Plugins.StructuresField("P1")]
public double Parameter1;
[Tekla.Structures.Plugins.StructuresField("P2")]
public string Parameter2;
}
[Plugin("BeamConnection")] // The name of the connection in the catalog
[PluginUserInterface(BeamConnection.UserInterfaceDefinitions.Plugin3)]
[SecondaryType(ConnectionBase.SecondaryType.SECONDARYTYPE_ONE)]
[AutoDirectionType(AutoDirectionTypeEnum.AUTODIR_BASIC)]
[PositionType(PositionTypeEnum.COLLISION_PLANE)]
public class BeamConnection: ConnectionBase
{
private StructuresData3 data;
private TSM.Model M;
public BeamConnection(StructuresData3 data)
{
this.data = data;
M = new TSM.Model();
}
TSM.Beam CreateBeam(Point Point1, Point Point2, string Profile)
{
TSM.Beam MyBeam = new TSM.Beam(Point1, Point2);
MyBeam.Profile.ProfileString = Profile;
MyBeam.Finish = "PAINT";
MyBeam.Position.Depth = Tekla.Structures.Model.Position.DepthEnum.MIDDLE;
MyBeam.Position.Plane = Tekla.Structures.Model.Position.PlaneEnum.RIGHT;
MyBeam.Insert();
return MyBeam;
}
Boolean CreateFitting(Point Point1, Point Point2, double Thickness, TSM.Beam MySecondary)
{
TSM.Fitting MyFitting = new TSM.Fitting();
MyFitting.Plane.Origin = new Point(Thickness, 0, 0);
MyFitting.Plane.AxisX = new Vector(0, 1000, 0);
MyFitting.Plane.AxisY = new Vector(0, 0, 1000);
MyFitting.Father = MySecondary;
return MyFitting.Insert();
}
public override bool Run()
{
try
{
// The default values
if(IsDefaultValue(data.Parameter1))
data.Parameter1 = 300.0;
if (IsDefaultValue(data.Parameter2))
data.Parameter2 = "PL10*300";
// Get secondary
TSM.Beam Secondary = M.SelectModelObject(Secondaries[0]) as TSM.Beam;
Point Point1 = new Point();
Point Point2 = new Point();
if (data.Parameter1 > 0)
{
Point1.Y -= data.Parameter1 / 2;
Point2.Y += data.Parameter1 / 2;
}
TSM.Beam NewBeam = CreateBeam(Point1, Point2, data.Parameter2);
double Thickness = 0.0;
NewBeam.GetReportProperty("PROFILE.WIDTH", ref Thickness);
CreateFitting(Point1, Point2, Thickness, Secondary);
}
catch(Exception e)
{
MessageBox.Show(e.ToString());
}
return true;
}
public class UserInterfaceDefinitions
{
public const string Plugin3 = @"" +
@"page(""TeklaStructures"","""")" + "\n" +
"{\n" +
"    joint(1, BeamConnection)\n" +
"    {\n" +
@"        tab_page(""Beam test"", ""Parameters"", 1)" + "\n" +
"        {\n" +
@"            parameter(""Plate Length"", ""P1"", distance, number, 1)" + "\n" +
@"            parameter(""Profile"", ""P2"", profile, text, 2)" + "\n" +
"        }\n" +
"    }\n" +
"}\n";
}
}